#include <array>

const std::array<const char *, 29> kQuestions = {
    "1. Теорема о гранях.\n"
    "2. Классы интегрируемых по Риману функций.",
    "1. Сходимость монотонной ограниченной последовательности.\n"
    "2. Достаточное условие Дарбу интегрируемости по Риману.",
    "1. Существование монотонной подпоследовательности и принцип выбора.\n"
    "2. Необходимое условие Дарбу интегрируемости по Риману.",
    "1. Критерий Коши для предела последовательности.\n"
    "2. Теорема о колебании непрерывной функции.",
    "1. Критерий Гейне для предела функции.\n"
    "2. Формула Ньютона-Лейбница.",
    "1. Формула Тейлора и теорема об остаточном члене.\n"
    "2. Формула Ньютона-Лейбница.",
    "1. Критерий непрерывности монотонной функции.\n"
    "2. Теорема о среднем и её геометрический смысл.",
    "1. Непрерывность обратной функции.\n"
    "2. Теорема об интегрируемости по Риману непрерывной функции.",
    "1. Непрерывность сложной функции.\n"
    "2. Критерий Коши интегрируемости по Риману.",
    "1. Теорема о стабилизации знака.\n"
    "2. Критерии монотонности и строгой монотонности.",
    "1. Теорема о локальной ограниченности непрерывной функции.\n"
    "2. Достаточные локального экстремума (три).",
    "1. Теорема о промежуточных значениях непрерывной функции.\n"
    "2. Критерий выпуклости дифференцируемой функции.",
    "1. Теорема Кантора о равномерной непрерывности.\n"
    "2. Достаточные условия перегиба функции (три).",
    "1. Теорема о производной обратной функции.\n"
    "2. Теорема о глобальном минимуме выпуклой функции.",
    "1. Теорема о производной сложной функции.\n"
    "2. Методы вычисления неопределенных интегралов (три).",
    "1. Определение дифференциала функции и критерий дифференцируемости.\n"
    "2. Интегрирование рациональных функций.",
    "1. Инвариантность формы первого дифференциала.\n"
    "2. Необходимое условие интегрируемости по Риману (сходимость последовательности",
    "1. Производная параметрически заданной функции.\n"
    "2. Ограниченность интегрируемой по Риману функции.",
    "1. Теорема Ферма (необходимое условие экстремума).\n"
    "2. Критерий Коши интегрируемости по Риману.",
    "1. Теорема Ролля.\n"
    "2. Теорема об интегрируемости по Риману непрерывной функции.",
    "1. Теорема Лагранжа.\n"
    "2. Теорема о среднем и её геометрический смысл.",
    "1. Теорема Коши.\n"
    "2. Теорема Барроу.",
    "1. Правило Лопиталя.\n"
    "2. Формула Ньютона-Лейбница.",
    "1. Формула Тейлора и теорема об остаточном члене.\n"
    "2. Теорема о колебании непрерывной функции.",
    "1. Остаточный член формулы Тейлора в форме Лагранжа.\n"
    "2. Необходимое условие Дарбу интегрируемости по Риману.",
    "1. Остаточный член формулы Тейлора в форме Коши.\n"
    "2. Классы интегрируемых по Риману функций.",
    "1. Остаточный член формулы Тейлора в форме Пеано.\n"
    "2. Достаточное условие Дарбу интегрируемости по Риману.",
    "1. Правило Лейбница.\n"
    "2. Интегрирование рационально-тригонометрических функций.",
    "1. Число е.\n"
    "2. Теорема Лагранжа."
};
